# EndSpace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPattern..::..EndSpace Property
BalusterPattern Class See Also
---
The extra space added after a whole baluster pattern.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public double EndSpace { get; set; }
```

Visual Basic
---
```text
Public Property EndSpace As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double EndSpace {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for endSpace must be between 0 and 30000 feet. |

# See Also
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace